package homeworks.homework_3


object max {

  /**
   * В данном задании предлагаем Вам из исходного списка целых чисел
   * сконструировать список его нестрогих локальных максимумов.
   *
   * Максимум является нестрогим, если он не меньше своих соседей по списку.
   *
   * Если у элемента меньше двух соседей, то он НЕ считается локальным максимумом.
   * */

  /**
   * @param ints список чисел, среди которых необходимо найти нестрогие локальные максимумы
   * @return список найденных нестрогих локальных максимумов
   */
  def maxima(ints: List[Int]): List[Int] = ???
}
